# SkyBackgroundSettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SkyBackgroundSettings Properties
SkyBackgroundSettings Class See Also
---
The SkyBackgroundSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from BackgroundSettings.) |

# See Also
SkyBackgroundSettings Class
Autodesk.Revit.DB Namespace